## Production: eks
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 2 to change, 2 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.logs-1-scanfiles-timeout-1-minute-warning will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "logs-1-scanfiles-timeout-1-minute-warning" {
      ~ alarm_description         = "One malware detected error in 1 minute" -> "One scanfiles timeout detected error in 1 minute"
        id                        = "logs-1-scanfiles-timeout-1-minute-warning"
        tags                      = {}
      ~ treat_missing_data        = "ignore" -> "notBreaching"
        # (16 unchanged attributes hidden)
    }

  # aws_security_group.quicksight will be created
  + resource "aws_security_group" "quicksight" {
      + arn                    = (known after apply)
      + description            = "Allow Quicksight to connect to RDS"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "quicksight"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0e02e0295db594518"
    }

  # aws_security_group_rule.notification-canada-ca-alb-quicksight-ingress will be created
  + resource "aws_security_group_rule" "notification-canada-ca-alb-quicksight-ingress" {
      + description              = "Access to Quicksight access through its security group"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-09e3175f46bc85607"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # aws_security_group_rule.quicksight-access-rds-eks will be created
  + resource "aws_security_group_rule" "quicksight-access-rds-eks" {
      + description              = "Connect Quicksight to RDS"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-09e3175f46bc85607"
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_wafv2_regex_pattern_set.re_admin will be destroyed
  # (because aws_wafv2_regex_pattern_set.re_admin is not in configuration)
  - resource "aws_wafv2_regex_pattern_set" "re_admin" {
      - arn         = "arn:aws:wafv2:ca-central-1:296255494825:regional/regexpatternset/re_admin/ac161757-5887-4282-a156-7c9bf6afc7b8" -> null
      - description = "Regex matching valid admin endpoints" -> null
      - id          = "ac161757-5887-4282-a156-7c9bf6afc7b8" -> null
      - lock_token  = "d3aecba1-73e2-4a5a-ba02-4757372b1fe3" -> null
      - name        = "re_admin" -> null
      - scope       = "REGIONAL" -> null
      - tags        = {
          - "CostCenter" = "notification-canada-ca-production"
        } -> null
      - tags_all    = {
          - "CostCenter" = "notification-canada-ca-production"
        } -> null

      - regular_expression {
          - regex_string = "/.well-known.*|/_email.*|/_letter.*|/_status.*|/_styleguide.*|/a11y.*|/accounts.*|/accounts-or-dashboard.*|/activity.*|/add-service.*|/agreement.*|/callbacks.*|/contact.*|/documentation.*|/email.*" -> null
        }
      - regular_expression {
          - regex_string = "/design-patterns-content-guidance.*|/letter-branding.*|/register-from-invite.*|/sign-in.*|/sign-out.*|/sms.*" -> null
        }
      - regular_expression {
          - regex_string = "/email-branding.*|/email-not-received.*|/error.*|/features.*|/find-services-by-name.*|/find-users-by-email.*|/forced-password-reset.*|/forgot-password.*|/format.*|/inbound-sms-admin.*|/invitation.*" -> null
        }
      - regular_expression {
          - regex_string = "/home|/accueil|/why-gc-notify|/pourquoi-gc-notification|/features|/fonctionnalites|/guidance|/guides-reference|/securit.+|/privacy.*|/confidentialite.*|/accessibility|/accessibilite" -> null
        }
      - regular_expression {
          - regex_string = "/letters.*|/messages-status.*|/new-password.*|/organisation-invitation.*|/organisations.*|/personalise.*|/platform-admin.*|/preview.*|/pricing.*|/provider.*|/providers.*|/register.*" -> null
        }
      - regular_expression {
          - regex_string = "/other-services|/autres-services|/service-level-agreement|/accord-niveaux-de-service|/service-level-objectives|/objectifs-niveau-de-service|/pourquoi-notification-gc" -> null
        }
      - regular_expression {
          - regex_string = "/register-from-org-invite.*|/registration-continue.*|/resend-email-verification.*|/roadmap.*|/robots.txt.*|/send-new-code.*|/send-new-email-token.*|/services.*|/services-or-dashboard.*|/set-lang.*" -> null
        }
      - regular_expression {
          - regex_string = "/static.*|/support.*|/templates.*|/text-not-received.*|/two-factor-email-sent.*|/two-factor-sms-sent.*|/user-profile.*|/users.*|/verify.*|/verify-email.*|/verify-mobile.*|/welcome.*|/why-notify.*" -> null
        }
      - regular_expression {
          - regex_string = "/terms|/conditions-dutilisation|/personalisation-guide|/guide-personnalisation|/message-delivery-status|/etat-livraison-messages|/formatting-guide|/guide-mise-en-forme|/spreadsheets|/feuille-de-calcu" -> null
        }
    }

  # aws_wafv2_regex_pattern_set.re_document_download will be destroyed
  # (because aws_wafv2_regex_pattern_set.re_document_download is not in configuration)
  - resource "aws_wafv2_regex_pattern_set" "re_document_download" {
      - arn         = "arn:aws:wafv2:ca-central-1:296255494825:regional/regexpatternset/re_document_download/813f6e1d-6b1d-4c67-a165-1bf90d7dc214" -> null
      - description = "Regex matching valid document download endpoints" -> null
      - id          = "813f6e1d-6b1d-4c67-a165-1bf90d7dc214" -> null
      - lock_token  = "f289f660-1c79-45ec-b58f-5dc083444d89" -> null
      - name        = "re_document_download" -> null
      - scope       = "REGIONAL" -> null
      - tags        = {
          - "CostCenter" = "notification-canada-ca-production"
        } -> null
      - tags_all    = {
          - "CostCenter" = "notification-canada-ca-production"
        } -> null

      - regular_expression {
          - regex_string = "/_status" -> null
        }
      - regular_expression {
          - regex_string = "/d/[\\S]{22}/[\\S]{22}" -> null
        }
      - regular_expression {
          - regex_string = "/services/[\\w]{8}-[\\w]{4}-[\\w]{4}-[\\w]{4}-[\\w]{12}/documents" -> null
        }
      - regular_expression {
          - regex_string = "/services/[\\w]{8}-[\\w]{4}-[\\w]{4}-[\\w]{4}-[\\w]{12}/documents/[\\w]{8}-[\\w]{4}-[\\w]{4}-[\\w]{4}-[\\w]{12}" -> null
        }
    }

  # aws_wafv2_web_acl.notification-canada-ca will be updated in-place
  ~ resource "aws_wafv2_web_acl" "notification-canada-ca" {
        id          = "0426a443-20b4-423d-be00-626fc7400dac"
        name        = "notification-canada-ca-waf"
        tags        = {
            "CostCenter" = "notification-canada-ca-production"
        }
        # (6 unchanged attributes hidden)


      ~ rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-sms-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-sms-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos-detected-load-balancer-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-api-high-request-count-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
